name = input("შეიყვანეთ თქვენი სახელი: ")
print(f"Hello {name}")

name = input("შეიყვანეთ თქვენი სახელი: ")
surname = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")
city = input("შეიყვანეთ თქვენი ქალაქი: ")

print(f"გამარჯობა, ჩემი სახელია {name} {surname}, ვარ {age} წლის და ვცხოვრობ ქალაქ {city}-ში.")

# input:

# input() ფუნქცია გამოიყენება, რათა მომხმარებლისგან მონაცემები მივიღოთ.
# ის აჩვენებს შეტყობინებას ეკრანზე და მომხმარებლის მიერ შეყვანილი ტექსტი ინახება ცვლადში.

# output:

# print() ფუნქცია გამოიყენება მონაცემების გამოსატანად.