#კოდი 1:
name = input("შეიყვანეთ თქვენი სახელი: ")
print(f"გამარჯობა, {name}")

#კოდი 2:
num1 = 5
num2 = 10
print(num1 + num2)

# კოდი 3:
age = int(input("თქვენი ასაკი? "))
if age >= 18:
    print("სრულწლოვანი ხარ.")
else:
    print("რასრულწლოვანი ხარ.")


121name = "ალეკო"  # ცვლადის სახელი არ შეიძლება დაიწყოს რიცხვით
print(121name)


prnt("გამარჯობა!")  # "prnt" არასწორი სახელია; სწორია "print"

num = "5wfr" + 10987  # არ შეიძლება სტრიქონის და რიცხვის დამატება
print(num)

Debugger:

# Debugger გამოიყენება პროგრამაში არსებული შეცდომების საპოვნელად და გასასწორებლად.